//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*! \page page05 Меню
    \code
           \
    Choice +- Настройки сигналов ---+- Канал ----+- A              *** Выбор настраиваемого канала ***
           |                        |            +- B              
           |                        |                              
    Choice |                        +- Форма ----+- Синус          *** Выбор формы сигнала ***
           |                        |            +- Пила+          
           |                        |            +- Пила-          
           |                        |            +- Импульс        
           |                        |                              
    Choice |                        +- Параметр -+- Частота        *** Выбор параметра для настройки ***
           |                        |            +- Период         
           |                        |            +- Амплитуда      
           |                        |            +- Смещение       
           |                        |            +- Длительность
           |                        |            +- Скважность     
           |                        |                              
    Button |                        +- Ввести значение параметра   *** Вввод числового значение выбранного параметра ***
           |                                                       
    Choice +- Настройки сигналов 2 -+- Засылка -+- Непрерывно      
           |                                    +- Однократно      
           |                                                       
    Choice +- Частотомер -----------+- Отображение -+- Откл        
           |                                        +- Вкл         
           |
    Choice +- Сервис ---------------+- Язык --------+- Русский     *** Выбор языка меню ***
           |                        |               +- Белорусский 
           |                        |               +- Английский
           |                        |
    Choice |                        +- Цвет фона ---+- Чёрный      *** Выбор цветовой схемы ***
           |                                        +- Белый
           |
    Choice +- Отладка --------------+- Консоль -----+- Откл        *** Включение/выключение отладочной консоли ***
                                    |                +- Вкл
                                    |
    Button                          +- Сохранить настройки         *** Сохранение текущего состояния прибора ***
                                    |
    Button                          +- Сброс                       *** Сброс настроек на настройки по умолчанию ***
         
     
    

    \endcode
*/
