//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*! \page page05 5. Меню
    \code
           \
    Page   +- НАСТРОЙКИ СИГНАЛОВ ---+
+   Choice |                        +- Канал ---------------------+- A
           |                        |                             +- B
           |                        |                             
    Choice |                        +- Форма ---------------------+- Синус
           |                        |                             +- Косинус
           |                        |                             +- Меандр
           |                        |                             +- Пила+
           |                        |                             +- Пила-          
           |                        |                             +- Импульс
           |                        |                             +- Произвольная
           |                        |                             
    Choice |                        +- Параметр ------------------+- Частота
           |                        |                             +- Период         
           |                        |                             +- Амплитуда      
           |                        |                             +- Смещение       
           |                        |                             +- Длительность
           |                        |                             +- Скважность
           |                        |                             +- Дополнительные
           |                        |                             +- Модуляция
           |                        |                             
    Page   |                        +- ВВЕСТИ ЗНАЧЕНИЕ ПАРАМЕТРА -+
+   Button |                                                      +- Лево
           |                                                      |
+   Button |                                                      +- Право
           |                                                      |
+   Button |                                                      +- Отказаться
           |                                                      |
+   Button |                                                      +- Подтвердить
           |                                                      |
    Page   |                                                      +- ВНЕШНЕЕ ЗУ ----+
           |                                                      |                 |
    Page   |                                                      |                 +- КАТАЛОГ -+
    Button |                                                      |                             +- Таб
           |                                                      |                             |
    Button |                                                      |                             +- Вниз
           |                                                      |                             |
    Button |                                                      |                             +- Вверх
           |                                                      |
    Page   |                                                      +- ВНУТРЕННЕЕ ЗУ -+
    Button |                                                      |                 +- Лево
           |                                                      |                 |
    Button |                                                      |                 +- Право
           |                                                      |                 |
    Button |                                                      |                 +- Выбрать
           |                                                      |
    Choice |                                                      +- Источник АМ ---+- A
           |                                                                        +- B
           |
    Page   +- НАСТРОЙКИ СИГНАЛОВ 2 -+
+   Choice |                        +- Засылка -------------------+- Непрерывно      
           |                                                      +- Однократно
           |
    Page   +- ЧАСТОТОМЕР -----------+                             
+   Choice |                        +- Отображение ---------------+- Откл        
           |                        |                             +- Вкл
           |                        |
+   Choice |                        +- Интервал запуска ----------+- 1 с
           |                        |                             +- 10 c
           |                        |
+   Choice |                        +- Время счёта ---------------+- 1 мс
           |                        |                             +- 10 мс
           |                        |                             +- 100 мс
           |                        |                             +- 1000 мс
           |                        |                             +- 10000 мс
           |                        |
    Page   |                        +- УСРЕДНЕНИЕ ----------------+
    Choice |                                                      +- Количество ----+= 1...1024
    Button |                                                      +- Сброс
           |           |
    Page   +- USB ------------------+                             
+   Choice |                        +- Размер байта --------------+- 7 бит
           |                        |                             +- 8 бит
           |                        |
+   Choice |                        +- Стоп-бит ------------------+- 1
           |                        |                             +- 2
           |                        |                             
+   Choice |                        +- Чётность ------------------+- Да
           |                                                      +- Нет
           |                                                      
    Page   +- СЕРВИС ---------------+
    Button |                        +- Сброс настроек
           |                        |
    Page   |                        +- КАЛИБРОВКА ----------------+- Синус
           |                        |                             +- Импульсы
           |                        |                             +- Произвольный
           |                        |
    Choice |                        +- Язык ----------------------+- Русский
           |                        |                             +- Белорусский
           |                        |                             +- Английский
           |                        |
    Choice |                        +- Цвет фона -----------------+- Чёрный
           |                        |                             +- Белый
           |                        |
    Page   |                        +- ПРОФИЛИ -------------------+
    Choice |                                                      +- Выбор ---------+- Профиль 1
           |                                                      |                 +- Профиль 2
           |                                                      |                 +- Профиль 3
           |                                                      |
    Button |                                                      +- Сохранить
           |
    Page   +- ОТЛАДКА --------------+                             
    Choice |                        +- Консоль -------------------+- Откл
           |                        |                             +- Вкл
           |                        |
    Button |                        +- Сохранить настройки
           |                        |
    Choice |                        +- Статистика ----------------+- Откл
                                                                  +- Вкл

    \endcode
*/
