//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*! \page page06 6. Сигналы и их параметры

    \code
    +--------------+---+---+---+----+---+---+---+---+---+------+------+---+---+---+
    | Форма        | F | T | А | См | t | t | t | t | L |Скважн|Заполн| M | Фи|Зад|
    |              |   |   |   |    |   |уст| н | сп|   |      |      |   |   |   |
    +--------------+---+---+---+----+---+---+---+---+---+------+------+---+---+---+
    | Синус        | + | + | + | +  |   |   |   |   |   |      |      | + | + | + |
    | Косинус      | + | + | + | +  |   |   |   |   |   |      |      | + | + | + |
    | Меандр       | + | + | + | +  |   |   |   |   |   |  +   |  +   |   |   |   |
    | Пила+        | + | + | + | +  | + |   | + |   | + |      |      |   |   |   |
    | Пила-        | + | + | + | +  | + |   |   | + | + |      |      |   |   |   |
    | Треугольник  | + | + | + | +  | + |   | + | + | + |      |      |   |   |   |
    | Трапеция     | + | + | + | +  | + | + | + | + | + |      |      |   |   |   |
    | Импульс      | + | + | + | +  | + |   |   |   | + |      |      |   |   |   |
    | Эксп+        |   |   |   |    |   |   |   |   |   |      |      |   |   |   |
    | Эксп-        |   |   |   |    |   |   |   |   |   |      |      |   |   |   |
    | Шум          |   |   | + | +  |   |   |   |   |   |      |      |   |   |   |
    | Произвольный | + | + | + | +  |   |   |   |   | + |      |      |   |   |   |
    +--------------+---+---+---+----+---+---+---+---+---+------+------+---+---+---+
    F - частота
    T - период
    A - амплитуда
    M - глубина амплитудной модуляции
    L - полярность
    См - смещение
    Фи - сдвиг фазы
    Зад - задержка
    t - длительность
    t н - длительность нарастания
    t сп - длительность спада
    t уст - длительность установившегося значения
    Скважн - скважность
    Заполн - заполнение
    \endcode
*/
