/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*! \page page08 8. Калибровка
    \tableofcontents

    \section sec81 1. Калибровка смещения в режиме генератора произвольных сигналов

    По нажатию кнопки "AD9952 +5В":\n
    - записать в регистр RG::3 или RG::4 (в зависимости от канала) коды, соответствующие максимальному значению сигнала.\n
    По вращению регулятора "AD9952 +5В":\n
    - изменять засылаемое в RG::2 значение амплитуды.\n
    По отжатию кнопки "AD9952 +5В":\n
    - записать в регистр RG::3 или RG::4 рабочие значения

*/
