#include "stdafx.h"
#ifndef WIN32
#include "CalibrationSettings.h"
#include "Hardware/Modules/EEPROM.h"
#endif


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
static const CalibrationSettings defSet =
{
    0,              // Это значение не должно равняться (-1), чтобы загрузчик мог определить наличие настроек в EEPROM-памяти
    {0, 0},         // AD9952 -5В
    {2048, 2048},   // AD9952 0В
    {4095, 4095},   // AD9952 +5В
    {0, 0},
    {0, 0},
    {0, 0}
};

CalibrationSettings set = defSet;

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void CalibrationSettings::Load()
{
    if (!EEPROM::LoadSettings(this))
    {
        *this = defSet;
    }
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void CalibrationSettings::Save()
{
    EEPROM::SaveSettings(this);
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
CalibrationSettings &CalibrationSettings::operator =(const CalibrationSettings &rhs)
{
    std::memcpy(this, rhs.unused, SIZE_STRUCT);

    return *this;
}

