#include "stdafx.h"
#ifndef WIN32
#include "defines.h"
#include "log.h"
#include "File.h"
#include "Utils/String.h"
#endif


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#define NUM_STRINGS 10
/// Здесь хранятся строки файла
static String strings[NUM_STRINGS];
/// Полное имя файла
static String name;

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/// Послать запрос на чтение i-й строки в файле
extern void SendRequestForString(int i);

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void File::Draw(int x, int y)
{
    if (name.IsEmpty())
    {
        return;
    }

    for (int i = 0; i < NUM_STRINGS; i++)
    {
        if (strings[i].IsEmpty())
        {
            FileRequests::SendRequestForString(&name, i);
        }
        else
        {
            strings[i].Draw(x, y + i * 10);
        }
    }
}



//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void File::Open(char *fullName)
{
    Close();
    name.From(fullName);
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void File::Close()
{
    name.Release();

    for (int i = 0; i < NUM_STRINGS; i++)
    {
        strings[i].Release();
    }
}
