#pragma once

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/// Последовательность передачи данных - от старшего к младшему  или от младшего к старшему
enum TransmissionSequence
{
    MSB_2_LSB,          ///< От старшего бита к младшему
    LSB_2_MSB           ///< От младшего бита к старшему
};

enum TypeWave
{
    TypeWave_Sin,
    TypeWave_Cos
};

enum Channel
{
    A,
    B,
    NumChannels
};
