#pragma once

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/// Последовательность передачи данных - от старшего к младшему  или от младшего к старшему
typedef enum
{
    MSB_2_LSB,          ///< От старшего бита к младшему
    LSB_2_MSB           ///< От младшего бита к старшему
} TransmissionSequence;

typedef enum
{
    TypeWave_Sin,
    TypeWave_Cos
} TypeWave;

typedef enum
{
    A,
    B,
    NumChannels
} Channel;
