#include "Include/PageSignals.h"
#include "Display/Painter.h"
#include "FDrive/FDrive.h"


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
extern const PageBase pLoad;
Page *PageSignals::PageLoad::pointer = (Page *)&pLoad;

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
static void OnPress_Up()
{

}

DEF_BUTTON( bUp,                                                                                            ///< ÍÀÑÒÐÎÉÊÈ ÑÈÃÍÀËÎÂ - ÇÀÃÐÓÇÊÀ - Ââåðõ
    "Ââåðõ", "Âíèç",
    "", "",
    pLoad, FuncActive, OnPress_Up, FuncDraw
)

//----------------------------------------------------------------------------------------------------------------------------------------------------
static void OnPress_Down()
{
}

DEF_BUTTON( bDown,                                                                                           ///< ÍÀÑÒÐÎÉÊÈ ÑÈÃÍÀËÎÂ - ÇÀÃÐÓÇÊÀ - Âíèç
    "Âíèç", "Down",
    "", "",
    pLoad, FuncActive, OnPress_Down, FuncDraw
)

//----------------------------------------------------------------------------------------------------------------------------------------------------
static void OnPress_Enter()
{
}

DEF_BUTTON(bEnter,                                                                                          ///< ÍÀÑÒÐÎÉÊÈ ÑÈÃÍÀËÎÂ - ÇÀÃÐÓÇÊÀ - Enter
    "Enter", "Enter",
    "", "",
    pLoad, FuncActive, OnPress_Enter, FuncDraw
)

//----------------------------------------------------------------------------------------------------------------------------------------------------
static void OnPress_Choose()
{
}

DEF_BUTTON(bChoose,                                                                                    ///< ÍÀÑÒÐÎÉÊÈ ÑÈÃÍÀËÎÂ - ÇÀÃÐÓÇÊÀ - Óñòàíîâèòü
    "Âûáðàòü", "Choose",
    "", "",
    pLoad, FuncActive, OnPress_Choose, FuncDraw
)


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
static bool OnKey(Control)
{
    return false;
}

DEF_PAGE_4( pLoad,                                                                                                  ///< ÍÀÑÒÐÎÉÊÈ ÑÈÃÍÀËÎÂ - ÇÀÃÐÓÇÊÀ
    "ÇÀÃÐÓÇÊÀ", "LOAD",
    "", "",
    &bUp,       ///< ÍÀÑÒÐÎÉÊÈ ÑÈÃÍÀËÎÂ - ÇÀÃÐÓÇÊÀ - Ââåðõ
    &bDown,     ///< ÍÀÑÒÐÎÉÊÈ ÑÈÃÍÀËÎÂ - ÇÀÃÐÓÇÊÀ - Âíèç
    &bEnter,    ///< ÍÀÑÒÐÎÉÊÈ ÑÈÃÍÀËÎÂ - ÇÀÃÐÓÇÊÀ - Enter
    &bChoose,   ///< ÍÀÑÒÐÎÉÊÈ ÑÈÃÍÀËÎÂ - ÇÀÃÐÓÇÊÀ - Óñòàíîâèòü
    Page::Settings_Load, PageSignals::pointer, FuncActive, FuncPress, OnKey, FDrive::Draw
)
