#include "PageUSB.h"
#include "Settings/Settings.h"


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
extern const PageBase pUSB;
Page *PageUSB::pointer = (Page *)&pUSB;


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
DEF_CHOICE_2(cSizeByte,                                                                                                   //--- USB - пюглеп аюирю ---
   "пюглеп аюирю", "SIZE BYTE",
   "", "",
   "7 АХР", "7 bits",
   "8 АХР", "8 bits",
   SIZE_BYTE, pUSB, FuncActive, FuncChangedChoice, FuncDraw
)

//----------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2(cStopBit,                                                                                                        //--- USB - ярно-ахр ---
    "ярно-ахр", "STOP-BIT",
    "", "",
    "1", "1",
    "2", "2",
    STOP_BIT, pUSB, FuncActive, FuncChangedChoice, FuncDraw
)

//----------------------------------------------------------------------------------------------------------------------------------------------------
DEF_CHOICE_2(cParity,                                                                                                         //--- USB - в╗рмнярэ ---
    "в╗рмнярэ", "PARITY",
    "", "",
    "опнбепърэ", "VERIFY",
    "ме опнбепърэ", "NOT VERIFY",
    PARITY, pUSB, FuncActive, FuncChangedChoice, FuncDraw
)

//----------------------------------------------------------------------------------------------------------------------------------------------------
DEF_PAGE_3(pUSB,                                                                                                                         //--- USB ---
    "USB", "USB",
    "мЮЯРПНИЙХ ОЮПЮЛЕРПНБ ЯБЪГХ ОН ХМРЕПТЕИЯС USB",
    "Communication parameters settings on the USB interface",
    cSizeByte,              ///< USB - пюглеп аюирю
    cStopBit,               ///< USB - ярно-ахр
    cParity,                ///< USB - в╗рмнярэ
    Page_USB, 0, FuncActive, FuncPress
)
