#pragma once


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template <typename T> class List;


template <typename T>
class ListElement
{
public:
    T *Get();
private:
    /// Указатель на список - владелец
    List<T> *owningList;
    /// Указатель на следующий элемент. 0, если это это последний элемент в списке
    ListElement *next;
    /// Указатель на предыдущий элемент. 0, если это первый элемент в списке
    ListElement *prev;
};


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template <typename T>
class List
{
public:
    /// Добавляем новый элемент в конец списка
    void Append(ListElement<T> *element);
    /// Возвращает true, если список содержит element
    bool Member(ListElement<T> *element);

    ListElement<T> *First();

    ListElement<T> *Next();
private:
    /// Указатель на первый элемент списка. 0, если список пуст
    ListElement<T> *head;
};
