#include "Wave.h"
#include "Settings/Settings.h"


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
WaveForm Wave::GetForm(Chan ch)
{
    return set.sig_form[ch];
}
*/

//----------------------------------------------------------------------------------------------------------------------------------------------------
void Wave::SetForm(Chan ch, WaveForm form)
{
    set.sig_form[ch] = form;
}

//----------------------------------------------------------------------------------------------------------------------------------------------------
pString Wave::Name(uint num, Language lang)
{
    static const pString names[WaveForm::Number][2] =
    {
        {"Синус", "Sine"},
    {"Косинус", "Cosine"}
    };

    return names[num][lang];
}
