#pragma once


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
    +------------------------------------------------+-------------+
    |             Служебное поле                     | Поле данных |
    +--------------+-----------------+---------------+-------------+
    | Номер пакета | Номер субпакета | Размер данных |   Данные    |
    +--------------+-----------------+---------------+-------------+
    |    0...3     |      4...7      |   8...11      | 12...63     |
    +--------------+-----------------+---------------+-------------+

    Данные могут занимать не всё поле для данных. В поле "Размер данных" рельное количество данных
*/

class Packet
{
public:
    Packet();
    /// Создаёт пакет из передаваемых данных
    void CreateNew(uint8 *data, uint size);

    void CopyFrom(const Packet *packet);
    /// Указатель на начало пакета
    uint8 *Begin();
    /// Размер пакета
    uint Size() const;
    /// Возвращает true, если пакеты идентичны (равны с точностью до бита)
    bool IsEquals(Packet *rhs) const;
    /// Возвращает указатель на начало поля данных
    uint8 *DataField();

private:
    /// Заполнить служебное поле значениями
    void FillServiceField(uint sizeData);
    /// Количество переданных пакетов. Все пакеты нумеруются по порядку.
    static uint transcievedPackets;

    /// Размер пакета
    static const uint SIZE = 64;
    /// Максимальный размер поля данных
    static const uint MAX_SIZE_DATA_FIELD = SIZE - 2 * sizeof(uint);

    struct Data
    {
        uint numberPacket;
        uint size;
        uint8 data[MAX_SIZE_DATA_FIELD];
    } data;
};
