#include "CommonTypes.h"
#include "defines.h"
#include "Wave.h"

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
pString Form::Name() const
{
    DEF_STRUCT(StructName, pString) names[Form::Number] =
    {
        "Синус",
        "Пила+",
        "Пила-",
        "Треугольник",
        "Меандр",
        "Импульс",
        "Пакет",
        "Произвольный"
    };

    return names[value].val;
}


