#pragma once
#include "Menu/MenuItems.h"


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
struct KoeffCal
{
    enum E
    {
        AD9952_NEG,     ///< Это значение определяет код, засылаемый для смещения -5В синусоидального сигнала
        AD9952_ZERO,    ///< Это значение определяет код, засылаемый для смещения 0В синусоидального сигнала
        AD9952_POS,     ///< Это значение определяет код, засылаемый для смещения +5В синусоидального сигнала
        AD9952_AMPL,    ///< Сотые доли процентов поправочного коэффициента к амплитуде синусоидального сигнала : ЗАСЫЛАЕМЫЙ_КОД = РАССЧИТАННЫЙ_КОД * (1 + AD9952_AMPL / 10000)
        DDS_MAX,
        DDS_MIN,
        Number
    } value;
};


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
class PageSignals
{
public:
    static void Init();

    static void OnPress_Channel(bool);

    static void OnPress_Form(bool);

    static Page *pointer;

    //---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    class PageLoad
    {
    public:
        static Page *pointer;
    };

    //---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    class PageCalibration
    {
    public:

        //-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        class PageA
        {
        public:
            static Page *pointer;
        };

        //-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        class PageB
        {
        public:
            static Page *pointer;
        };

        static void OnPress_OffsetAD9952(Chan ch, bool enter, KoeffCal::E koeff);

        static void OnPress_AmplitudeAD9952(Chan ch, bool enter, KoeffCal::E koeff);

        static void WriteKoeffCal(Chan ch, KoeffCal::E koeff);
    };
};
